#include <iostream> //подключаем директиву для ввода и вывода
#include <locale> //подключаем директиву для русского языка
using namespace std; //подключаем стандартное в c++ пространство имён

void calcul(){ //создаём функцию, которая в основном и будет проводить все операции

    //вводи исходные данные
    int m, n;
    cout << "Введите m и n: " << endl;
    cin >> m >> n;
    cout << endl;

    //1)
    int m1 = m, n1 = n;
    int res1 = m1 - ++n1; //т.к. операция вычитания, то используем тип int
    cout << "m-++n: " << endl << res1 << endl;

    //2)
    int m2 = m, n2 = n;
    bool res2 = ++m2 > --n2; //т.к. операция сравнения, то используем тип bool
    cout << "++m>--n: " << endl << res2 << endl;
    
    //3)
    int m3 = m, n3 = n;
    bool res3 = --n3 < ++m3; //аналогично с примером 2)
    cout << "--n<++m: " << endl << res3 << endl;
}

int main(){ //главная функция, вызывающая основную
    setlocale(LC_ALL,".65001"); //подключаем русский язык

    calcul();

    return 0; //возвращаем 0, если правильно работает программа
}